In [2]:
import pandas as pd

# APPEND DataFrame dan Dictionary

## a. Dictionary dengan value berupa string dan integer

In [25]:
df = pd.DataFrame({'no'    : [1 , 2 , 3 , 4 ] ,
                   'hewan' : ['ayam' , 'bebek' , 'sapi' , 'kucing'] ,
                   'Owner' : ['dadan' , 'didin' , 'deden' , 'dudin']
                   })

df

   no   hewan  Owner
0   1    ayam  dadan
1   2   bebek  didin
2   3    sapi  deden
3   4  kucing  dudin

In [33]:
dictionary = {'no'    : 5 ,
             'hewan' : 'capung' ,
             'Owner' : 'adi'
            }

dictionary

{'no': 5, 'hewan': 'capung', 'Owner': 'adi'}

In [36]:
df_result = df.append(dictionary, ignore_index=True)
df_result

/var/folders/_v/w4n5bq8d4ln32c93xcpqrnxc0000gn/T/ipykernel_9329/1728484303.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_result = df.append(dictionary, ignore_index=True)

   no   hewan  Owner
0   1    ayam  dadan
1   2   bebek  didin
2   3    sapi  deden
3   4  kucing  dudin
4   5  capung    adi

## b. Dictionary dengan value berupa List

In [27]:
dictionary2 = {'no'    : [5, 6, 7, 8, 9, 10] ,
             'hewan' : ['capung','gajah', 'kucing', 'ikan', 'jerapah', 'singa'] ,
             'Owner' : ['adi','ade','ado','edo','edi','edu']
            }

dictionary2

{'no': [5, 6, 7, 8, 9, 10],
 'hewan': ['capung', 'gajah', 'kucing', 'ikan', 'jerapah', 'singa'],
 'Owner': ['adi', 'ade', 'ado', 'edo', 'edi', 'edu']}

In [31]:
df_result = df.append(dictionary2, ignore_index=True)
#df_result = pd.concat((df,dictionary2))
df_result

/var/folders/_v/w4n5bq8d4ln32c93xcpqrnxc0000gn/T/ipykernel_9329/2150337116.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_result = df.append(dictionary2, ignore_index=True)

,no,hewan,Owner
0,1,ayam,dadan
1,2,bebek,didin
2,3,sapi,deden
3,4,kucing,dudin
4,"[5, 6, 7, 8, 9, 10]","[capung, gajah, kucing, ikan, jerapah, singa]","[adi, ade, ado, edo, edi, edu]"

## c. Dictionary dengan value berupa kombinasi List/Dict/String/Integer

In [4]:
dictionary3 = {'no'    : [5, 6, 8] ,
             'hewan' : ['capung','gajah', {'location' : 'ragunan',
                                           'name' : ['jerapah','singa']}] ,
             'Owner' : {'city' : 'bekasi',
                        'name' : 'adi',
                        'hobby' : ['memancing','menulis','menari'],
                        'cita-cita' : {'SD' : 'pilot',
                                       'SMP' : 'dokter',
                                       'SMA' : 'youtuber',
                                       'Sekarang' : 'Presiden'}
                       }
            }

pd.DataFrame(dictionary3)

ValueError: Mixing dicts with non-Series may lead to ambiguous ordering.

In [12]:
df_result = df.append(dictionary3, ignore_index=True)
df_result

,no,hewan,Owner
0,1,ayam,dadan
1,2,bebek,didin
2,3,sapi,deden
3,4,kucing,dudin
4,"[5, 6, 8]","[capung, gajah, {'location': 'ragunan', 'name'...","{'city': 'bekasi', 'name': 'adi', 'hobby': ['m..."

## d. Aturan append

### Aturan-1 : Total Keys tidak harus = Total kolom

In [13]:
# Df berikut memiliki 3 kolom (no, hewan dan owner)

df = pd.DataFrame({'no'    : [1 , 2 , 3 , 4 ] ,
                   'hewan' : ['ayam' , 'bebek' , 'sapi' , 'kucing'] ,
                   'Owner' : ['dadan' , 'didin' , 'deden' , 'dudin']
                   })

# Dictionary berikut hanya memiliki 2 keys (no dan hewan)

dictionary = {'no'    : 5 ,
             'hewan' : 'capung'
            }

In [14]:
df.append(dictionary, ignore_index=True)

   no   hewan  Owner
0   1    ayam  dadan
1   2   bebek  didin
2   3    sapi  deden
3   4  kucing  dudin
4   5  capung    NaN

### Aturan-2 : Urutan keys pada Dict dan kolom pada DataFrame tidak harus sama

In [15]:
# Df berikut memiliki kolom dengan ururtan no, hewan dan owner

df = pd.DataFrame({'no'    : [1 , 2 , 3 , 4 ] ,
                   'hewan' : ['ayam' , 'bebek' , 'sapi' , 'kucing'] ,
                   'owner' : ['dadan' , 'didin' , 'deden' , 'dudin']
                   })

# Dictionary berikut memiliki 3 keys dengan ururtan no, owner dan hewan

dictionary = {'no'    : 5 ,
              'owner' : 'ade',
             'hewan' : 'capung'
            }

In [17]:
df.append(dictionary, ignore_index=True)

   no   hewan  owner
0   1    ayam  dadan
1   2   bebek  didin
2   3    sapi  deden
3   4  kucing  dudin
4   5  capung    ade

### Aturan-3 : Dictionary memiliki jumlah keys > total kolom pada df

In [18]:
# Df berikut memiliki 3 kolom

df = pd.DataFrame({'no'    : [1 , 2 , 3 , 4 ] ,
                   'hewan' : ['ayam' , 'bebek' , 'sapi' , 'kucing'] ,
                   'Owner' : ['dadan' , 'didin' , 'deden' , 'dudin']
                   })

# Dictionary berikut memiliki 4 keys 

dictionary = {'no'    : 5 ,
              'hewan' : 'capung',
              'owner' : 'ade',
              'lokasi' : 'ragunan'
            }

In [20]:
df.append(dictionary, ignore_index=True)

   no   hewan  Owner   lokasi owner
0   1    ayam  dadan      NaN   NaN
1   2   bebek  didin      NaN   NaN
2   3    sapi  deden      NaN   NaN
3   4  kucing  dudin      NaN   NaN
4   5  capung    NaN  ragunan   ade

# APPEND DataFrame dan DataFrame

In [3]:
df1 = pd.DataFrame({'no'    : [1 , 2 , 3 , 4 ] ,
                    'hewan' : ['ayam' , 'bebek' , 'sapi' , 'kucing'] ,
                    'owner' : ['dadan' , 'didin' , 'deden' , 'dudin']
                   })

df1

   no   hewan  owner
0   1    ayam  dadan
1   2   bebek  didin
2   3    sapi  deden
3   4  kucing  dudin

In [4]:
df2 = pd.DataFrame({'no'    : [5 , 6 , 7] ,
                    'hewan' : ['capung' , 'semut' , 'udang' ] ,
                    'OWNER' : ['adi','ade','ado'],
                    'sepatu' : [40,42,40]
                   })

df2

   no   hewan OWNER  sepatu
0   5  capung   adi      40
1   6   semut   ade      42
2   7   udang   ado      40

In [24]:
data = df1.append(df2, ignore_index=True)

data

   no   hewan  owner OWNER  sepatu
0   1    ayam  dadan   NaN     NaN
1   2   bebek  didin   NaN     NaN
2   3    sapi  deden   NaN     NaN
3   4  kucing  dudin   NaN     NaN
4   5  capung    NaN   adi    40.0
5   6   semut    NaN   ade    42.0
6   7   udang    NaN   ado    40.0

# Merge DataFrame

In [11]:
users = pd.DataFrame({'id'   : [1,2,3,4,5,6,7,8],
                      'nama' : ['Ade', 'Hendra' ,'Ammar', 'Andhika', 
                                'Rezki', 'Fauzan', 'Choiri', 'Suprapto'],
                      'umur' : [17, 25, 40, 10, 34, 43, 34, 22]})

users

   id      nama  umur
0   1       Ade    17
1   2    Hendra    25
2   3     Ammar    40
3   4   Andhika    10
4   5     Rezki    34
5   6    Fauzan    43
6   7    Choiri    34
7   8  Suprapto    22

In [8]:
hobi = pd.DataFrame({'nama' : ['Ade', 'Hendra' ,'Ammar', 'Heri', 
                               'Rezki', 'Gunawan', 'Choiri'],
                     'hobi' : ['memasak','basket','musik','gundu',
                               'menari', 'berenang' ,'mendaki']})

hobi

      nama      hobi
0      Ade   memasak
1   Hendra    basket
2    Ammar     musik
3     Heri     gundu
4    Rezki    menari
5  Gunawan  berenang
6   Choiri   mendaki

In [13]:
# df1.merge(d2, on='', how='')

users.merge(hobi, left_on='nama',right_on='nama', how='inner') #left, inner, right, outer

   id    nama  umur     hobi
0   1     Ade    17  memasak
1   2  Hendra    25   basket
2   3   Ammar    40    musik
3   5   Rezki    34   menari
4   7  Choiri    34  mendaki

In [9]:
data = users.merge(hobi, on='nama', how='left')

In [16]:
data[data['hobi'].notnull()]
#data

   id    nama  umur     hobi
0   1     Ade    17  memasak
1   2  Hendra    25   basket
2   3   Ammar    40    musik
4   5   Rezki    34   menari
6   7  Choiri    34  mendaki

# Merge Multiple On Columns

In [17]:
users

   id      nama  umur
0   1       Ade    17
1   2    Hendra    25
2   3     Ammar    40
3   4   Andhika    10
4   5     Rezki    34
5   6    Fauzan    43
6   7    Choiri    34
7   8  Suprapto    22

In [18]:
hobi

      nama      hobi
0      Ade   memasak
1   Hendra    basket
2    Ammar     musik
3     Heri     gundu
4    Rezki    menari
5  Gunawan  berenang
6   Choiri   mendaki

In [22]:
new_users = pd.DataFrame({
    "id": [9, 10, 11],
    "nama": ["Ade", "Rezki", "Fauzan"],
    "umur": [20, 31, 42]
})
append_users = users.append(new_users, ignore_index=True)
append_users["kota"] = ["Bogor", "Jakarta", "Bogor", "Depok", "Tangerang", "Bekasi", "Bogor", "Depok", "Tangerang", "Tangerang", "Bogor"]
append_users

/var/folders/_v/w4n5bq8d4ln32c93xcpqrnxc0000gn/T/ipykernel_9329/3122857533.py:6: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  append_users = users.append(new_users, ignore_index=True)

    id      nama  umur       kota
0    1       Ade    17      Bogor
1    2    Hendra    25    Jakarta
2    3     Ammar    40      Bogor
3    4   Andhika    10      Depok
4    5     Rezki    34  Tangerang
5    6    Fauzan    43     Bekasi
6    7    Choiri    34      Bogor
7    8  Suprapto    22      Depok
8    9       Ade    20  Tangerang
9   10     Rezki    31  Tangerang
10  11    Fauzan    42      Bogor

In [23]:
append_hobi = hobi
append_hobi["kota"] = ["Bogor", "Depok", "Tangerang", "Bekasi", "Tangerang", "Bogor", "Tangerang"]
append_hobi

      nama      hobi       kota
0      Ade   memasak      Bogor
1   Hendra    basket      Depok
2    Ammar     musik  Tangerang
3     Heri     gundu     Bekasi
4    Rezki    menari  Tangerang
5  Gunawan  berenang      Bogor
6   Choiri   mendaki  Tangerang

In [92]:
append_users.merge(
    append_hobi, 
    left_on=["nama", "kota"],
    right_on=["nama", "kota"],
    how="inner"
)

   id   nama  umur       kota     hobi
0   1    Ade    17      Bogor  memasak
1   5  Rezki    34  Tangerang   menari
2  10  Rezki    31  Tangerang   menari

In [98]:
append_users.merge(
    append_hobi, 
    left_on=["nama", "kota"],
    right_on=["nama", "kota"],
    how="left"
)

    id      nama  umur       kota     hobi
0    1       Ade    17      Bogor  memasak
1    2    Hendra    25    Jakarta      NaN
2    3     Ammar    40      Bogor      NaN
3    4   Andhika    10      Depok      NaN
4    5     Rezki    34  Tangerang   menari
5    6    Fauzan    43     Bekasi      NaN
6    7    Choiri    34      Bogor      NaN
7    8  Suprapto    22      Depok      NaN
8    9       Ade    20  Tangerang      NaN
9   10     Rezki    31  Tangerang   menari
10  11    Fauzan    42      Bogor      NaN

In [ ]:
# Jika dataset nya sudah banyak untuk menampilkan seluruh kolom :
# method 1
pd.set_option('display.max_columns', None)
pd.set_option('display.max_rows', None)

#method 2
pd.options.display.max_columns = None
pd.options.display.max_rows = None

read_csv